Ran Plan for 2 projects:

1. project: `vpc/tmcd_apnortheast2` dir: `terraform/vpc/tmcd_apnortheast2` workspace: `default`
1. project: `eks/tmcd_apnortheast2/tmcdapne2-nhwy` dir: `terraform/eks/tmcd_apnortheast2/tmcdapne2-nhwy` workspace: `default`

### 1. project: `vpc/tmcd_apnortheast2` dir: `terraform/vpc/tmcd_apnortheast2` workspace: `default`
<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # aws_ec2_tag.private_subnet_tags["subnet-00954dff2b638bdd8_Network"] will be created
+ resource "aws_ec2_tag" "private_subnet_tags" {
      + id          = (known after apply)
      + key         = "Network"
      + resource_id = "subnet-00954dff2b638bdd8"
      + value       = "Private"
    }

  # aws_ec2_tag.private_subnet_tags["subnet-00954dff2b638bdd8_kubernetes.io/cluster/tmcdapne2-nhwy"] will be created
+ resource "aws_ec2_tag" "private_subnet_tags" {
      + id          = (known after apply)
      + key         = "kubernetes.io/cluster/tmcdapne2-nhwy"
      + resource_id = "subnet-00954dff2b638bdd8"
      + value       = "shared"
    }

  # aws_ec2_tag.private_subnet_tags["subnet-00954dff2b638bdd8_kubernetes.io/role/internal-elb"] will be created
+ resource "aws_ec2_tag" "private_subnet_tags" {
      + id          = (known after apply)
      + key         = "kubernetes.io/role/internal-elb"
      + resource_id = "subnet-00954dff2b638bdd8"
      + value       = "1"
    }

  # aws_ec2_tag.private_subnet_tags["subnet-08d60c5582e7bab2c_Network"] will be created
+ resource "aws_ec2_tag" "private_subnet_tags" {
      + id          = (known after apply)
      + key         = "Network"
      + resource_id = "subnet-08d60c5582e7bab2c"
      + value       = "Private"
    }

  # aws_ec2_tag.private_subnet_tags["subnet-08d60c5582e7bab2c_kubernetes.io/cluster/tmcdapne2-nhwy"] will be created
+ resource "aws_ec2_tag" "private_subnet_tags" {
      + id          = (known after apply)
      + key         = "kubernetes.io/cluster/tmcdapne2-nhwy"
      + resource_id = "subnet-08d60c5582e7bab2c"
      + value       = "shared"
    }

  # aws_ec2_tag.private_subnet_tags["subnet-08d60c5582e7bab2c_kubernetes.io/role/internal-elb"] will be created
+ resource "aws_ec2_tag" "private_subnet_tags" {
      + id          = (known after apply)
      + key         = "kubernetes.io/role/internal-elb"
      + resource_id = "subnet-08d60c5582e7bab2c"
      + value       = "1"
    }

  # aws_ec2_tag.public_subnet_tags["subnet-066f15f574c7f1a3d_kubernetes.io/cluster/tmcdapne2-nhwy"] will be created
+ resource "aws_ec2_tag" "public_subnet_tags" {
      + id          = (known after apply)
      + key         = "kubernetes.io/cluster/tmcdapne2-nhwy"
      + resource_id = "subnet-066f15f574c7f1a3d"
      + value       = "shared"
    }

  # aws_ec2_tag.public_subnet_tags["subnet-066f15f574c7f1a3d_kubernetes.io/role/elb"] will be created
+ resource "aws_ec2_tag" "public_subnet_tags" {
      + id          = (known after apply)
      + key         = "kubernetes.io/role/elb"
      + resource_id = "subnet-066f15f574c7f1a3d"
      + value       = "1"
    }

  # aws_ec2_tag.public_subnet_tags["subnet-0a33d6a2708cc9f5c_kubernetes.io/cluster/tmcdapne2-nhwy"] will be created
+ resource "aws_ec2_tag" "public_subnet_tags" {
      + id          = (known after apply)
      + key         = "kubernetes.io/cluster/tmcdapne2-nhwy"
      + resource_id = "subnet-0a33d6a2708cc9f5c"
      + value       = "shared"
    }

  # aws_ec2_tag.public_subnet_tags["subnet-0a33d6a2708cc9f5c_kubernetes.io/role/elb"] will be created
+ resource "aws_ec2_tag" "public_subnet_tags" {
      + id          = (known after apply)
      + key         = "kubernetes.io/role/elb"
      + resource_id = "subnet-0a33d6a2708cc9f5c"
      + value       = "1"
    }

  # aws_ec2_tag.vpc_tags["Name"] will be created
+ resource "aws_ec2_tag" "vpc_tags" {
      + id          = (known after apply)
      + key         = "Name"
      + resource_id = "vpc-02bd27f3ad9337b18"
      + value       = "vpc-tmcd_apnortheast2"
    }

  # aws_ec2_tag.vpc_tags["kubernetes.io/cluster/tmcdapne2-nhwy"] will be created
+ resource "aws_ec2_tag" "vpc_tags" {
      + id          = (known after apply)
      + key         = "kubernetes.io/cluster/tmcdapne2-nhwy"
      + resource_id = "vpc-02bd27f3ad9337b18"
      + value       = "shared"
    }

  # aws_vpc.default will be updated in-place
~ resource "aws_vpc" "default" {
        id                                   = "vpc-02bd27f3ad9337b18"
      ~ tags                                 = {
          + "Name" = "vpc-tmcd_apnortheast2"
        }
      ~ tags_all                             = {
          + "Name" = "vpc-tmcd_apnortheast2"
        }
        # (17 unchanged attributes hidden)
    }

Plan: 12 to add, 1 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p vpc/tmcd_apnortheast2`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.terraform.devart.tv/lock?id=DevopsArtFactory%252Fterraform-provisioning%252Fterraform%252Fvpc%252Ftmcd_apnortheast2%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p vpc/tmcd_apnortheast2`
</details>
Plan: 12 to add, 1 to change, 0 to destroy.

---
### 2. project: `eks/tmcd_apnortheast2/tmcdapne2-nhwy` dir: `terraform/eks/tmcd_apnortheast2/tmcdapne2-nhwy` workspace: `default`
<details><summary>Show Output</summary>

```diff
data.terraform_remote_state.vpc: Reading...
data.terraform_remote_state.vpc: Read complete after 1s
module.eks.data.aws_kms_alias.ebs: Reading...
module.eks.data.aws_iam_policy_document.assume_role: Reading...
module.eks.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=3552664922]
module.eks.data.aws_kms_alias.ebs: Read complete after 1s [id=arn:aws:kms:ap-northeast-2:066346343248:alias/aws/ebs]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
 <= read (data resources)

Terraform will perform the following actions:

  # module.eks.data.aws_security_group.cluster_sg will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_security_group" "cluster_sg" {
      + arn         = (known after apply)
      + description = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + tags        = {
          + "aws:eks:cluster-name" = "tmcdapne2-nhwy"
        }
      + vpc_id      = (known after apply)
    }

  # module.eks.data.tls_certificate.oidc will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "oidc" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.eks.aws_autoscaling_group_tag.aws_node_termination_handler_asg[0] will be created
+ resource "aws_autoscaling_group_tag" "aws_node_termination_handler_asg" {
      + autoscaling_group_name = (known after apply)
      + id                     = (known after apply)

      + tag {
          + key                 = "aws-node-termination-handler/managed"
          + propagate_at_launch = true
          + value               = "true"
        }
    }

  # module.eks.aws_autoscaling_group_tag.aws_node_termination_handler_asg[1] will be created
+ resource "aws_autoscaling_group_tag" "aws_node_termination_handler_asg" {
      + autoscaling_group_name = (known after apply)
      + id                     = (known after apply)

      + tag {
          + key                 = "aws-node-termination-handler/managed"
          + propagate_at_launch = true
          + value               = "true"
        }
    }

  # module.eks.aws_autoscaling_lifecycle_hook.aws_node_termination_handler_asg[0] will be created
+ resource "aws_autoscaling_lifecycle_hook" "aws_node_termination_handler_asg" {
      + autoscaling_group_name = (known after apply)
      + default_result         = "CONTINUE"
      + heartbeat_timeout      = 300
      + id                     = (known after apply)
      + lifecycle_transition   = "autoscaling:EC2_INSTANCE_TERMINATING"
      + name                   = (known after apply)
    }

  # module.eks.aws_autoscaling_lifecycle_hook.aws_node_termination_handler_asg[1] will be created
+ resource "aws_autoscaling_lifecycle_hook" "aws_node_termination_handler_asg" {
      + autoscaling_group_name = (known after apply)
      + default_result         = "CONTINUE"
      + heartbeat_timeout      = 300
      + id                     = (known after apply)
      + lifecycle_transition   = "autoscaling:EC2_INSTANCE_TERMINATING"
      + name                   = (known after apply)
    }

  # module.eks.aws_cloudwatch_event_rule.aws_node_termination_handler["tmcdapne2-nhwy-aws-node-termination-handler-health-check"] will be created
+ resource "aws_cloudwatch_event_rule" "aws_node_termination_handler" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail      = {
                  + eventTypeCategory = [
                      + "scheduledChange",
                    ]
                  + service           = [
                      + "EC2",
                    ]
                }
              + detail-type = [
                  + "AWS Health Event",
                ]
              + source      = [
                  + "aws.health",
                ]
            }
        )
      + force_destroy  = false
      + id             = (known after apply)
      + name           = "tmcdapne2-nhwy-aws-node-termination-handler-health-check"
      + name_prefix    = (known after apply)
      + tags_all       = (known after apply)
    }

  # module.eks.aws_cloudwatch_event_rule.aws_node_termination_handler["tmcdapne2-nhwy-aws-node-termination-handler-spot-terminate"] will be created
+ resource "aws_cloudwatch_event_rule" "aws_node_termination_handler" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail-type = [
                  + "EC2 Spot Instance Interruption Warning",
                ]
              + source      = [
                  + "aws.ec2",
                ]
            }
        )
      + force_destroy  = false
      + id             = (known after apply)
      + name           = "tmcdapne2-nhwy-aws-node-termination-handler-spot-terminate"
      + name_prefix    = (known after apply)
      + tags_all       = (known after apply)
    }

  # module.eks.aws_cloudwatch_event_target.aws_node_termination_handler["tmcdapne2-nhwy-aws-node-termination-handler-health-check"] will be created
+ resource "aws_cloudwatch_event_target" "aws_node_termination_handler" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = "tmcdapne2-nhwy-aws-node-termination-handler-health-check"
      + target_id      = (known after apply)
    }

  # module.eks.aws_cloudwatch_event_target.aws_node_termination_handler["tmcdapne2-nhwy-aws-node-termination-handler-spot-terminate"] will be created
+ resource "aws_cloudwatch_event_target" "aws_node_termination_handler" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = "tmcdapne2-nhwy-aws-node-termination-handler-spot-terminate"
      + target_id      = (known after apply)
    }

  # module.eks.aws_ec2_tag.karpenter_cluster_sg_tag will be created
+ resource "aws_ec2_tag" "karpenter_cluster_sg_tag" {
      + id          = (known after apply)
      + key         = "karpenter.sh/discovery"
      + resource_id = (known after apply)
      + value       = "tmcdapne2-nhwy"
    }

  # module.eks.aws_ec2_tag.karpenter_private_subnet_tag["subnet-00954dff2b638bdd8"] will be created
+ resource "aws_ec2_tag" "karpenter_private_subnet_tag" {
      + id          = (known after apply)
      + key         = "karpenter.sh/discovery"
      + resource_id = "subnet-00954dff2b638bdd8"
      + value       = "tmcdapne2-nhwy"
    }

  # module.eks.aws_ec2_tag.karpenter_private_subnet_tag["subnet-08d60c5582e7bab2c"] will be created
+ resource "aws_ec2_tag" "karpenter_private_subnet_tag" {
      + id          = (known after apply)
      + key         = "karpenter.sh/discovery"
      + resource_id = "subnet-08d60c5582e7bab2c"
      + value       = "tmcdapne2-nhwy"
    }

  # module.eks.aws_eks_access_entry.access_entry["accountadmin"] will be created
+ resource "aws_eks_access_entry" "access_entry" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "tmcdapne2-nhwy"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::066346343248:user/zerone"
      + tags              = {
          + "account"    = "id"
          + "aws_region" = "ap-northeast-2"
          + "product"    = "tmc"
          + "shard_id"   = "tmcdapne2"
        }
      + tags_all          = {
          + "account"    = "id"
          + "aws_region" = "ap-northeast-2"
          + "product"    = "tmc"
          + "shard_id"   = "tmcdapne2"
        }
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # module.eks.aws_eks_access_policy_association.access_policy_association["accountadmin-kubeadmin"] will be created
+ resource "aws_eks_access_policy_association" "access_policy_association" {
      + associated_at = (known after apply)
      + cluster_name  = "tmcdapne2-nhwy"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::066346343248:user/zerone"

      + access_scope {
          + type = "cluster"
        }
    }

  # module.eks.aws_eks_addon.coredns will be created
+ resource "aws_eks_addon" "coredns" {
      + addon_name                  = "coredns"
      + addon_version               = "v1.11.1-eksbuild.9"
      + arn                         = (known after apply)
      + cluster_name                = "tmcdapne2-nhwy"
      + configuration_values        = jsonencode(
            {
              + nodeSelector = {
                  + capacity_type = "cpu_on_demand"
                }
            }
        )
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_create = "OVERWRITE"
      + tags_all                    = (known after apply)
    }

  # module.eks.aws_eks_addon.ebs_csi will be created
+ resource "aws_eks_addon" "ebs_csi" {
      + addon_name                  = "aws-ebs-csi-driver"
      + addon_version               = "v1.34.0-eksbuild.1"
      + arn                         = (known after apply)
      + cluster_name                = "tmcdapne2-nhwy"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_create = "OVERWRITE"
      + tags_all                    = (known after apply)
    }

  # module.eks.aws_eks_addon.kube_proxy will be created
+ resource "aws_eks_addon" "kube_proxy" {
      + addon_name                  = "kube-proxy"
      + addon_version               = "v1.30.0-eksbuild.3"
      + arn                         = (known after apply)
      + cluster_name                = "tmcdapne2-nhwy"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_create = "OVERWRITE"
      + tags_all                    = (known after apply)
    }

  # module.eks.aws_eks_addon.vpc_cni will be created
+ resource "aws_eks_addon" "vpc_cni" {
      + addon_name                  = "vpc-cni"
      + addon_version               = "v1.18.3-eksbuild.1"
      + arn                         = (known after apply)
      + cluster_name                = "tmcdapne2-nhwy"
      + configuration_values        = jsonencode(
            {
              + enableNetworkPolicy = "true"
            }
        )
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_create = "OVERWRITE"
      + service_account_role_arn    = (known after apply)
      + tags_all                    = (known after apply)
    }

  # module.eks.aws_eks_cluster.eks_cluster will be created
+ resource "aws_eks_cluster" "eks_cluster" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "tmcdapne2-nhwy"
      + platform_version              = (known after apply)
      + role_arn                      = (known after apply)
      + status                        = (known after apply)
      + tags                          = {
          + "Name"       = "tmcdapne2-nhwy"
          + "account"    = "id"
          + "aws_region" = "ap-northeast-2"
          + "product"    = "tmc"
          + "shard_id"   = "tmcdapne2"
        }
      + tags_all                      = {
          + "Name"       = "tmcdapne2-nhwy"
          + "account"    = "id"
          + "aws_region" = "ap-northeast-2"
          + "product"    = "tmc"
          + "shard_id"   = "tmcdapne2"
        }
      + version                       = "1.30"

      + access_config {
          + authentication_mode                         = "API_AND_CONFIG_MAP"
          + bootstrap_cluster_creator_admin_permissions = true
        }

      + kubernetes_network_config {
          + ip_family         = (known after apply)
          + service_ipv4_cidr = "172.20.0.0/16"
          + service_ipv6_cidr = (known after apply)
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = (known after apply)
          + subnet_ids                = [
              + "subnet-00954dff2b638bdd8",
              + "subnet-08d60c5582e7bab2c",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_eks_node_group.eks_node_group["ondemand_1_30_4-20241024"] will be created
+ resource "aws_eks_node_group" "eks_node_group" {
      + ami_type               = "AL2023_x86_64_STANDARD"
      + arn                    = (known after apply)
      + capacity_type          = "ON_DEMAND"
      + cluster_name           = "tmcdapne2-nhwy"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.large",
        ]
      + labels                 = {
          + "capacity_type" = "cpu_on_demand"
          + "cpu_chip"      = "intel"
        }
      + node_group_name        = "tmcdapne2-nhwy-ng-ondemand_1_30_4-20241024"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = (known after apply)
      + release_version        = "1.30.4-20241024"
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-00954dff2b638bdd8",
          + "subnet-08d60c5582e7bab2c",
        ]
      + tags                   = {
          + "Name"                                 = "tmcdapne2-nhwy-ng-ondemand_1_30_4-20241024"
          + "account"                              = "id"
          + "aws_region"                           = "ap-northeast-2"
          + "kubernetes.io/cluster/tmcdapne2-nhwy" = "owned"
          + "product"                              = "tmc"
          + "shard_id"                             = "tmcdapne2"
        }
      + tags_all               = {
          + "Name"                                 = "tmcdapne2-nhwy-ng-ondemand_1_30_4-20241024"
          + "account"                              = "id"
          + "aws_region"                           = "ap-northeast-2"
          + "kubernetes.io/cluster/tmcdapne2-nhwy" = "owned"
          + "product"                              = "tmc"
          + "shard_id"                             = "tmcdapne2"
        }
      + version                = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + scaling_config {
          + desired_size = 2
          + max_size     = 2
          + min_size     = 2
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # module.eks.aws_eks_node_group.eks_node_group["spot_1_30_4-20241024"] will be created
+ resource "aws_eks_node_group" "eks_node_group" {
      + ami_type               = "AL2023_x86_64_STANDARD"
      + arn                    = (known after apply)
      + capacity_type          = "SPOT"
      + cluster_name           = "tmcdapne2-nhwy"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.large",
        ]
      + labels                 = {
          + "capacity_type" = "spot"
          + "cpu_chip"      = "intel"
        }
      + node_group_name        = "tmcdapne2-nhwy-ng-spot_1_30_4-20241024"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = (known after apply)
      + release_version        = "1.30.4-20241024"
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-00954dff2b638bdd8",
          + "subnet-08d60c5582e7bab2c",
        ]
      + tags                   = {
          + "Name"                                 = "tmcdapne2-nhwy-ng-spot_1_30_4-20241024"
          + "account"                              = "id"
          + "aws_region"                           = "ap-northeast-2"
          + "kubernetes.io/cluster/tmcdapne2-nhwy" = "owned"
          + "product"                              = "tmc"
          + "shard_id"                             = "tmcdapne2"
        }
      + tags_all               = {
          + "Name"                                 = "tmcdapne2-nhwy-ng-spot_1_30_4-20241024"
          + "account"                              = "id"
          + "aws_region"                           = "ap-northeast-2"
          + "kubernetes.io/cluster/tmcdapne2-nhwy" = "owned"
          + "product"                              = "tmc"
          + "shard_id"                             = "tmcdapne2"
        }
      + version                = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + scaling_config {
          + desired_size = 2
          + max_size     = 10
          + min_size     = 2
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # module.eks.aws_fis_experiment_template.aws_node_termination_handler_fis will be created
+ resource "aws_fis_experiment_template" "aws_node_termination_handler_fis" {
      + description = "Spot Interrupt for testing node termination handler"
      + id          = (known after apply)
      + role_arn    = (known after apply)
      + tags        = {
          + "Name" = "aws_node_termination_handler_fis"
        }
      + tags_all    = {
          + "Name" = "aws_node_termination_handler_fis"
        }

      + action {
          + action_id   = "aws:ec2:send-spot-instance-interruptions"
          + description = "Terminate spots"
          + name        = "instance-terminate"
          + start_after = []

          + parameter {
              + key   = "durationBeforeInterruption"
              + value = "PT2M"
            }

          + target {
              + key   = "SpotInstances"
              + value = "eks-spot-node-nth-handled"
            }
        }

      + stop_condition {
          + source = "none"
        }

      + target {
          + name           = "eks-spot-node-nth-handled"
          + resource_arns  = []
          + resource_type  = "aws:ec2:spot-instance"
          + selection_mode = "COUNT(1)"

          + filter {
              + path   = "State.Name"
              + values = [
                  + "running",
                ]
            }

          + resource_tag {
              + key   = "aws-node-termination-handler/managed"
              + value = "true"
            }
          + resource_tag {
              + key   = "aws:eks:cluster-name"
              + value = "tmcdapne2-nhwy"
            }
        }
    }

  # module.eks.aws_iam_instance_profile.eks_node_group will be created
+ resource "aws_iam_instance_profile" "eks_node_group" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "eks-tmcdapne2-nhwy-ng"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "eks-tmcdapne2-nhwy-ng"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.eks.aws_iam_openid_connect_provider.eks will be created
+ resource "aws_iam_openid_connect_provider" "eks" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags_all        = (known after apply)
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # module.eks.aws_iam_policy.alb_controller will be created
+ resource "aws_iam_policy" "alb_controller" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "eks-tmcdapne2-nhwy-alb-controller-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "iam:CreateServiceLinkedRole"
                      + Condition = {
                          + StringEquals = {
                              + "iam:AWSServiceName" = "elasticloadbalancing.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:DescribeAccountAttributes",
                          + "ec2:DescribeAddresses",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeVpcs",
                          + "ec2:DescribeVpcPeeringConnections",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DescribeTags",
                          + "ec2:GetCoipPoolUsage",
                          + "ec2:DescribeCoipPools",
                          + "elasticloadbalancing:DescribeLoadBalancers",
                          + "elasticloadbalancing:DescribeLoadBalancerAttributes",
                          + "elasticloadbalancing:DescribeListeners",
                          + "elasticloadbalancing:DescribeListenerCertificates",
                          + "elasticloadbalancing:DescribeSSLPolicies",
                          + "elasticloadbalancing:DescribeRules",
                          + "elasticloadbalancing:DescribeTargetGroups",
                          + "elasticloadbalancing:DescribeTargetGroupAttributes",
                          + "elasticloadbalancing:DescribeTargetHealth",
                          + "elasticloadbalancing:DescribeTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "cognito-idp:DescribeUserPoolClient",
                          + "acm:ListCertificates",
                          + "acm:DescribeCertificate",
                          + "iam:ListServerCertificates",
                          + "iam:GetServerCertificate",
                          + "waf-regional:GetWebACL",
                          + "waf-regional:GetWebACLForResource",
                          + "waf-regional:AssociateWebACL",
                          + "waf-regional:DisassociateWebACL",
                          + "wafv2:GetWebACL",
                          + "wafv2:GetWebACLForResource",
                          + "wafv2:AssociateWebACL",
                          + "wafv2:DisassociateWebACL",
                          + "shield:GetSubscriptionState",
                          + "shield:DescribeProtection",
                          + "shield:CreateProtection",
                          + "shield:DeleteProtection",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:RevokeSecurityGroupIngress",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:CreateSecurityGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateTags",
                        ]
                      + Condition = {
                          + Null         = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                          + StringEquals = {
                              + "ec2:CreateAction" = "CreateSecurityGroup"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:security-group/*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateTags",
                          + "ec2:DeleteTags",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:security-group/*"
                    },
                  + {
                      + Action    = [
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:RevokeSecurityGroupIngress",
                          + "ec2:DeleteSecurityGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:CreateLoadBalancer",
                          + "elasticloadbalancing:CreateTargetGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:CreateListener",
                          + "elasticloadbalancing:DeleteListener",
                          + "elasticloadbalancing:CreateRule",
                          + "elasticloadbalancing:DeleteRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:AddTags",
                          + "elasticloadbalancing:RemoveTags",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:AddTags",
                          + "elasticloadbalancing:RemoveTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:elasticloadbalancing:*:*:listener/net/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener/app/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/net/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/app/*/*/*",
                        ]
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:AddTags",
                        ]
                      + Condition = {
                          + Null         = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                          + StringEquals = {
                              + "elasticloadbalancing:CreateAction" = [
                                  + "CreateTargetGroup",
                                  + "CreateLoadBalancer",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:ModifyLoadBalancerAttributes",
                          + "elasticloadbalancing:SetIpAddressType",
                          + "elasticloadbalancing:SetSecurityGroups",
                          + "elasticloadbalancing:SetSubnets",
                          + "elasticloadbalancing:DeleteLoadBalancer",
                          + "elasticloadbalancing:ModifyTargetGroup",
                          + "elasticloadbalancing:ModifyTargetGroupAttributes",
                          + "elasticloadbalancing:DeleteTargetGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:RegisterTargets",
                          + "elasticloadbalancing:DeregisterTargets",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:SetWebAcl",
                          + "elasticloadbalancing:ModifyListener",
                          + "elasticloadbalancing:AddListenerCertificates",
                          + "elasticloadbalancing:RemoveListenerCertificates",
                          + "elasticloadbalancing:ModifyRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.eks.aws_iam_policy.aws_node_termination_handler will be created
+ resource "aws_iam_policy" "aws_node_termination_handler" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "eks-tmcdapne2-nhwy-aws-node-termination-handler-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "autoscaling:CompleteLifecycleAction",
                          + "autoscaling:DescribeAutoScalingInstances",
                          + "autoscaling:DescribeTags",
                          + "ec2:DescribeInstances",
                          + "sqs:DeleteMessage",
                          + "sqs:ReceiveMessage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.eks.aws_iam_policy.aws_node_termination_handler_fis will be created
+ resource "aws_iam_policy" "aws_node_termination_handler_fis" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "For FIS with Note Termination Handler"
      + id               = (known after apply)
      + name             = "eks-tmcdapne2-nhwy-aws-node-termination-handler-fis-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:SendSpotInstanceInterruptions",
                          + "ec2:TerminateInstances",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ec2:*:066346343248:instance/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.eks.aws_iam_policy.external_secrets will be created
+ resource "aws_iam_policy" "external_secrets" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "eks-tmcdapne2-nhwy-external-secrets"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "kms:GetPublicKey",
                          + "kms:Decrypt",
                          + "kms:ListKeyPolicies",
                          + "kms:ListRetirableGrants",
                          + "kms:GetKeyPolicy",
                          + "kms:ListResourceTags",
                          + "kms:ListGrants",
                          + "kms:GetParametersForImport",
                          + "kms:DescribeCustomKeyStores",
                          + "kms:ListKeys",
                          + "kms:GetKeyRotationStatus",
                          + "kms:Encrypt",
                          + "kms:ListAliases",
                          + "kms:DescribeKey",
                        ]
                      + Condition = {
                          + "ForAllValues:StringEquals" = {
                              + "aws:ResourceTag/kubernetes.io/cluster/tmcdapne2-nhwy" = [
                                  + "owned",
                                  + "shared",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:kms:ap-northeast-2:066346343248:key/79e6d15d-a3b1-431a-a6a2-ae9c63c25ddb",
                        ]
                    },
                  + {
                      + Action    = [
                          + "ssm:GetParameterHistory",
                          + "ssm:GetParameters",
                          + "ssm:GetParameter",
                          + "ssm:DescribeParameters",
                          + "ssm:GetParametersByPath",
                        ]
                      + Condition = {
                          + "ForAllValues:StringEquals" = {
                              + "aws:ResourceTag/kubernetes.io/cluster/tmcdapne2-nhwy" = [
                                  + "owned",
                                  + "shared",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "*",
                        ]
                    },
                  + {
                      + Action    = [
                          + "secretsmanager:ListSecrets",
                          + "secretsmanager:GetResourcePolicy",
                          + "secretsmanager:GetSecretValue",
                          + "secretsmanager:DescribeSecret",
                          + "secretsmanager:ListSecretVersionIds",
                        ]
                      + Condition = {
                          + "ForAllValues:StringEquals" = {
                              + "aws:ResourceTag/kubernetes.io/cluster/tmcdapne2-nhwy" = [
                                  + "owned",
                                  + "shared",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.eks.aws_iam_policy.karpenter_controller will be created
+ resource "aws_iam_policy" "karpenter_controller" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "eks-tmcdapne2-nhwy-karpenter-controller-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:GetParameter",
                          + "iam:PassRole",
                          + "ec2:DescribeImages",
                          + "ec2:RunInstances",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeLaunchTemplates",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeInstanceTypes",
                          + "ec2:DescribeInstanceTypeOfferings",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DeleteLaunchTemplate",
                          + "ec2:CreateTags",
                          + "ec2:CreateLaunchTemplate",
                          + "ec2:CreateFleet",
                          + "ec2:DescribeSpotPriceHistory",
                          + "pricing:GetProducts",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "Karpenter"
                    },
                  + {
                      + Action    = "ec2:TerminateInstances"
                      + Condition = {
                          + StringLike = {
                              + "ec2:ResourceTag/Name" = "*karpenter*"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = "ConditionalEC2Termination"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.eks.aws_iam_policy.route53 will be created
+ resource "aws_iam_policy" "route53" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "eks-tmcdapne2-nhwy-route53"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "route53:ChangeResourceRecordSets",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:route53:::hostedzone/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "route53:ListHostedZones",
                          + "route53:ListResourceRecordSets",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.eks.aws_iam_role.alb_controller_assumerole will be created
+ resource "aws_iam_role" "alb_controller_assumerole" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-tmcdapne2-nhwy-alb-controller"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.eks.aws_iam_role.aws_node_termination_handler will be created
+ resource "aws_iam_role" "aws_node_termination_handler" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-tmcdapne2-nhwy-aws-node-termination-handler"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.eks.aws_iam_role.aws_node_termination_handler_fis will be created
+ resource "aws_iam_role" "aws_node_termination_handler_fis" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "fis.amazonaws.com",
                            ]
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-tmcdapne2-nhwy-aws-node-termination-handler-fis-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.eks.aws_iam_role.cni_irsa_role will be created
+ resource "aws_iam_role" "cni_irsa_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + description           = "CNI plugin role for EKS cluster tmcdapne2-nhwy"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-tmcdapne2-nhwy-cni-plugin"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.eks.aws_iam_role.eks_cluster will be created
+ resource "aws_iam_role" "eks_cluster" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Allows access to other AWS service resources that are required to operate clusters managed by EKS."
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-tmcdapne2-nhwy"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.eks.aws_iam_role.eks_node_group will be created
+ resource "aws_iam_role" "eks_node_group" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Allows EC2 instances to call AWS services on your behalf."
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-tmcdapne2-nhwy-ng"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.eks.aws_iam_role.external_dns will be created
+ resource "aws_iam_role" "external_dns" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-tmcdapne2-nhwy-external-dns"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.eks.aws_iam_role.external_secrets will be created
+ resource "aws_iam_role" "external_secrets" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-tmcdapne2-nhwy-external-secrets"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.eks.aws_iam_role.karpenter_controller will be created
+ resource "aws_iam_role" "karpenter_controller" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-tmcdapne2-nhwy-karpenter-controller"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.alb_controller will be created
+ resource "aws_iam_role_policy_attachment" "alb_controller" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "eks-tmcdapne2-nhwy-alb-controller"
    }

  # module.eks.aws_iam_role_policy_attachment.aws_node_termination_handler will be created
+ resource "aws_iam_role_policy_attachment" "aws_node_termination_handler" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "eks-tmcdapne2-nhwy-aws-node-termination-handler"
    }

  # module.eks.aws_iam_role_policy_attachment.aws_node_termination_handler_fis will be created
+ resource "aws_iam_role_policy_attachment" "aws_node_termination_handler_fis" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "eks-tmcdapne2-nhwy-aws-node-termination-handler-fis-role"
    }

  # module.eks.aws_iam_role_policy_attachment.cni_irsa_policy will be created
+ resource "aws_iam_role_policy_attachment" "cni_irsa_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "eks-tmcdapne2-nhwy-cni-plugin"
    }

  # module.eks.aws_iam_role_policy_attachment.eks_cluster_AmazonEKSClusterPolicy will be created
+ resource "aws_iam_role_policy_attachment" "eks_cluster_AmazonEKSClusterPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "eks-tmcdapne2-nhwy"
    }

  # module.eks.aws_iam_role_policy_attachment.eks_cluster_AmazonEKSVPCResourceController will be created
+ resource "aws_iam_role_policy_attachment" "eks_cluster_AmazonEKSVPCResourceController" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = "eks-tmcdapne2-nhwy"
    }

  # module.eks.aws_iam_role_policy_attachment.eks_node_AmazonEBSCSIDriverPolicy will be created
+ resource "aws_iam_role_policy_attachment" "eks_node_AmazonEBSCSIDriverPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEBSCSIDriverPolicy"
      + role       = "eks-tmcdapne2-nhwy-ng"
    }

  # module.eks.aws_iam_role_policy_attachment.eks_node_AmazonEC2ContainerRegistryReadOnly will be created
+ resource "aws_iam_role_policy_attachment" "eks_node_AmazonEC2ContainerRegistryReadOnly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "eks-tmcdapne2-nhwy-ng"
    }

  # module.eks.aws_iam_role_policy_attachment.eks_node_AmazonEKSWorkerNodePolicy will be created
+ resource "aws_iam_role_policy_attachment" "eks_node_AmazonEKSWorkerNodePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "eks-tmcdapne2-nhwy-ng"
    }

  # module.eks.aws_iam_role_policy_attachment.eks_node_AmazonEKS_CNI_Policy will be created
+ resource "aws_iam_role_policy_attachment" "eks_node_AmazonEKS_CNI_Policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "eks-tmcdapne2-nhwy-ng"
    }

  # module.eks.aws_iam_role_policy_attachment.eks_node_AmazonSSMManagedInstanceCore will be created
+ resource "aws_iam_role_policy_attachment" "eks_node_AmazonSSMManagedInstanceCore" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "eks-tmcdapne2-nhwy-ng"
    }

  # module.eks.aws_iam_role_policy_attachment.external_dns_route53 will be created
+ resource "aws_iam_role_policy_attachment" "external_dns_route53" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "eks-tmcdapne2-nhwy-external-dns"
    }

  # module.eks.aws_iam_role_policy_attachment.external_secrets will be created
+ resource "aws_iam_role_policy_attachment" "external_secrets" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "eks-tmcdapne2-nhwy-external-secrets"
    }

  # module.eks.aws_iam_role_policy_attachment.karpenter_controller will be created
+ resource "aws_iam_role_policy_attachment" "karpenter_controller" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "eks-tmcdapne2-nhwy-karpenter-controller"
    }

  # module.eks.aws_launch_template.eks_node_group[0] will be created
+ resource "aws_launch_template" "eks_node_group" {
      + arn             = (known after apply)
      + default_version = (known after apply)
      + id              = (known after apply)
      + latest_version  = (known after apply)
      + name            = "tmcdapne2-nhwy-node-launch-template"
      + name_prefix     = (known after apply)
      + tags_all        = (known after apply)

      + block_device_mappings {
          + device_name = "/dev/xvda"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + iops                  = 3000
              + kms_key_id            = "arn:aws:kms:ap-northeast-2:066346343248:alias/aws/ebs"
              + throughput            = 125
              + volume_size           = 30
              + volume_type           = "gp3"
            }
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = 2
          + http_tokens                 = "optional"
          + instance_metadata_tags      = (known after apply)
        }
    }

  # module.eks.aws_security_group.eks_cluster will be created
+ resource "aws_security_group" "eks_cluster" {
      + arn                    = (known after apply)
      + description            = "Cluster communication with Worker Nodes"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.10.0.0/16",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = true
              + to_port          = 0
            },
        ]
      + name                   = "eks-tmcdapne2-nhwy-cluster-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"                                 = "eks-tmcdapne2-nhwy-cluster-sg"
          + "account"                              = "id"
          + "aws_region"                           = "ap-northeast-2"
          + "kubernetes.io/cluster/tmcdapne2-nhwy" = "owned"
          + "product"                              = "tmc"
          + "shard_id"                             = "tmcdapne2"
        }
      + tags_all               = {
          + "Name"                                 = "eks-tmcdapne2-nhwy-cluster-sg"
          + "account"                              = "id"
          + "aws_region"                           = "ap-northeast-2"
          + "kubernetes.io/cluster/tmcdapne2-nhwy" = "owned"
          + "product"                              = "tmc"
          + "shard_id"                             = "tmcdapne2"
        }
      +
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.